In [1]:
import numpy as np 
import pandas as pd

In [3]:
!pip install numpy matplotlib pandas

Requirement already satisfied: numpy in e:\jupyter\lib\site-packages (1.26.4)
Requirement already satisfied: matplotlib in e:\jupyter\lib\site-packages (3.8.4)
Requirement already satisfied: pandas in e:\jupyter\lib\site-packages (2.2.2)
Requirement already satisfied: contourpy>=1.0.1 in e:\jupyter\lib\site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: cycler>=0.10 in e:\jupyter\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in e:\jupyter\lib\site-packages (from matplotlib) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in e:\jupyter\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: packaging>=20.0 in e:\jupyter\lib\site-packages (from matplotlib) (23.2)
Requirement already satisfied: pillow>=8 in e:\jupyter\lib\site-packages (from matplotlib) (10.3.0)
Requirement already satisfied: pyparsing>=2.3.1 in e:\jupyter\lib\site-packages (from matplotlib) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in e:\jupyter\lib\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in e:\jupyter\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in e:\jupyter\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in e:\jupyter\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)

In [5]:
import numpy as np 
from matplotlib import pyplot as plt 
import pandas as pd

In [7]:
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [9]:
#create a dictionary first 
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [24, 27, 22],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago

In [13]:
# Select a single column
print(df['Name'])

print(df[['Name', 'Age']])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
      Name  Age
0    Alice   24
1      Bob   27
2  Charlie   22

In [15]:
# Select first two rows
print(df.iloc[:2])

#Select rows by label index
print(df.loc[1])

    Name  Age         City
0  Alice   24     New York
1    Bob   27  Los Angeles
Name            Bob
Age              27
City    Los Angeles
Name: 1, dtype: object

In [17]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Salary': [50000, 52000, 60000, 62000, 58000]
}
df = pd.DataFrame(data)

#Group by Department and calculate the mean salary
grouped = df.groupby('Department')['Salary'].mean()
print(grouped)

Department
Finance    58000.0
HR         51000.0
IT         61000.0
Name: Salary, dtype: float64

In [21]:
fileName = "test.xlsx"
df.to_excel(fileName)

In [31]:
rd = pd.read_excel("./test.xlsx")  #relative path 
rd

   Unnamed: 0 Department Employee  Salary
0           0         HR    Alice   50000
1           1         HR      Bob   52000
2           2         IT  Charlie   60000
3           3         IT    David   62000
4           4    Finance      Eve   58000

In [33]:
rd["Result"] = rd["Multiplier"]*2
rd

KeyError: 'Multiplier'

In [35]:
fileName = "test1.xlsx"
df.to_excel(fileName)

In [37]:
rd = pd.read_excel("./test1.xlsx")  #relative path 
rd

   Unnamed: 0 Department Employee  Salary
0           0         HR    Alice   50000
1           1         HR      Bob   52000
2           2         IT  Charlie   60000
3           3         IT    David   62000
4           4    Finance      Eve   58000

In [39]:
rd = pd.read_excel("./test1.xlsx")  #relative path 
rd

   Unnamed: 0  Department  Employee  Salary
0           0          10       100   50000
1           1          20       200   52000
2           2          30       300   60000
3           3          40       400   62000
4           4          50       500   58000

In [43]:
rd["Result"] = rd["Salary"]*2
rd

   Unnamed: 0  Department  Employee  Salary  Result
0           0          10       100   50000  100000
1           1          20       200   52000  104000
2           2          30       300   60000  120000
3           3          40       400   62000  124000
4           4          50       500   58000  116000

In [45]:
rd["Result"] = rd["Department"]*2
rd

   Unnamed: 0  Department  Employee  Salary  Result
0           0          10       100   50000      20
1           1          20       200   52000      40
2           2          30       300   60000      60
3           3          40       400   62000      80
4           4          50       500   58000     100

In [47]:
rd["Result"] = rd["Department"] * rd["Salary"]
rd

   Unnamed: 0  Department  Employee  Salary   Result
0           0          10       100   50000   500000
1           1          20       200   52000  1040000
2           2          30       300   60000  1800000
3           3          40       400   62000  2480000
4           4          50       500   58000  2900000

In [57]:
#threshold value is being checked by addiong the variable threshold as 60000 
#if it crosses the threshold value then it ll give true else false 
th = 60000
rd["Salary"] < th

0     True
1     True
2    False
3    False
4     True
Name: Salary, dtype: bool